<template>
  <h1 class="text-center">{{ is_mobile ? 'Добро пожаловать' : 'Добро пожаловать в Симулятор обмана' }}</h1>

  <template v-if="is_mobile">
    <div class="text-justify">
      Место, где кликер денег становится безумным весельем! Здесь вы можете щелкать
      мышкой, чтобы заработать виртуальные деньги и затем тратить их на самые нелепые и безумные вещи в нашем
      магазине.
      У нас также есть казино, где вы можете испытать свою удачу и выиграть еще больше виртуальных богатств!
      Откройте
      для себя безграничное разнообразие виртуальных товаров и наслаждайтесь азартным безумием!
    </div>
    <div class="flex-box-center">
      <img src="/src/assets/images/main.png" alt="main" width="300">
    </div>
    <div class="border-red">
      **Примечание:**<br>
      Симулятор обмана предназначен только для развлекательных целей. Виртуальные деньги и товары не имеют реальной
      ценности
      и не могут быть обменены на реальные деньги или товары. Пожалуйста, играйте ответственно и помните, что здесь
      главное - веселье и разрядка!
    </div>
  </template>

  <template v-else>
    <div class="flex-box">
      <div style="display: flex; align-items: center; width: 50%; padding-right: 20px">
        <img style="max-width: 100%" src="/src/assets/images/main.png" alt="main">
      </div>
      <div style="width: 50%">
        <div class="text-justify">
          Место, где кликер денег становится безумным весельем! Здесь вы можете щелкать
          мышкой, чтобы заработать виртуальные деньги и затем тратить их на самые нелепые и безумные вещи в нашем
          магазине.
          У нас также есть казино, где вы можете испытать свою удачу и выиграть еще больше виртуальных богатств!
          Откройте
          для себя безграничное разнообразие виртуальных товаров и наслаждайтесь азартным безумием!
        </div>
        <div class="border-red">
          **Примечание:**<br>
          Симулятор обмана предназначен только для развлекательных целей. Виртуальные деньги и товары не имеют
          реальной
          ценности
          и не могут быть обменены на реальные деньги или товары. Пожалуйста, играйте ответственно и помните, что
          здесь
          главное - веселье и разрядка!
        </div>
      </div>
    </div>
  </template>
</template>

<script lang="ts">
import {app} from "@/app_config";

export default {
  name: "HomeView",
  setup() {
    return {
      is_mobile: app.is_mobile
    }
  }
}
</script>


